const hiragana = {
  // Vokal
  "あ":"A","い":"I","う":"U","え":"E","お":"O",

  // K
  "か":"KA","き":"KI","く":"KU","け":"KE","こ":"KO",
  "が":"GA","ぎ":"GI","ぐ":"GU","げ":"GE","ご":"GO",

  // S
  "さ":"SA","し":"SHI","す":"SU","せ":"SE","そ":"SO",
  "ざ":"ZA","じ":"JI","ず":"ZU","ぜ":"ZE","ぞ":"ZO",

  // T
  "た":"TA","ち":"CHI","つ":"TSU","て":"TE","と":"TO",
  "だ":"DA","ぢ":"JI","づ":"ZU","で":"DE","ど":"DO",

  // N
  "な":"NA","に":"NI","ぬ":"NU","ね":"NE","の":"NO",

  // H
  "は":"HA","ひ":"HI","ふ":"FU","へ":"HE","ほ":"HO",
  "ば":"BA","び":"BI","ぶ":"BU","べ":"BE","ぼ":"BO",
  "ぱ":"PA","ぴ":"PI","ぷ":"PU","ぺ":"PE","ぽ":"PO",

  // M
  "ま":"MA","み":"MI","む":"MU","め":"ME","も":"MO",

  // Y
  "や":"YA","ゆ":"YU","よ":"YO",

  // R
  "ら":"RA","り":"RI","る":"RU","れ":"RE","ろ":"RO",

  // W
  "わ":"WA","を":"WO",

  // N
  "ん":"N",

  // Spesial
  "ゔ":"VU",
};



const katakana = {
  // Vokal
  "ア":"A","イ":"I","ウ":"U","エ":"E","オ":"O",

  // K
  "カ":"KA","キ":"KI","ク":"KU","ケ":"KE","コ":"KO",
  "ガ":"GA","ギ":"GI","グ":"GU","ゲ":"GE","ゴ":"GO",

  // S
  "サ":"SA","シ":"SHI","ス":"SU","セ":"SE","ソ":"SO",
  "ザ":"ZA","ジ":"JI","ズ":"ZU","ゼ":"ZE","ゾ":"ZO",

  // T
  "タ":"TA","チ":"CHI","ツ":"TSU","テ":"TE","ト":"TO",
  "ダ":"DA","ヂ":"JI","ヅ":"ZU","デ":"DE","ド":"DO",

  // N
  "ナ":"NA","ニ":"NI","ヌ":"NU","ネ":"NE","ノ":"NO",

  // H
  "ハ":"HA","ヒ":"HI","フ":"FU","ヘ":"HE","ホ":"HO",
  "バ":"BA","ビ":"BI","ブ":"BU","ベ":"BE","ボ":"BO",
  "パ":"PA","ピ":"PI","プ":"PU","ペ":"PE","ポ":"PO",

  // M
  "マ":"MA","ミ":"MI","ム":"MU","メ":"ME","モ":"MO",

  // Y
  "ヤ":"YA","ユ":"YU","ヨ":"YO",

  // R
  "ラ":"RA","リ":"RI","ル":"RU","レ":"RE","ロ":"RO",

  // W
  "ワ":"WA","ヲ":"WO",

  // N
  "ン":"N",

  // Spesial
  "ヴ":"VU",

  // Huruf kecil
  "ァ":"A","ィ":"I","ゥ":"U","ェ":"E","ォ":"O",
  "ャ":"YA","ュ":"YU","ョ":"YO",
  "ッ":"TSU","ヮ":"WA",

  // Tanda panjang
  "ー":"-"
};



const kanji = {
"日":"NI",
"月":"TSUKI",
"火":"KA",
"水":"SUI",
"木":"KI"
};

